AUR/LXQT/lxde-qt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>lxde-qt</title>
<!-- 2014-02-26 Wed 09:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">lxde-qt</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. LXDE Package Tables</a></li>
<li><a href="#sec-2">2. Step by step package build</a></li>
<li><a href="#sec-3">3. </a></li>
<li><a href="#sec-4">4. </a></li>
<li><a href="#sec-5">5. LXDE-Qt</a></li>
<li><a href="#sec-6">6. Package Building Documentation</a>
<ul>
<li><a href="#sec-6-1">6.1. VCS<sub>PKGBUILD</sub><sub>Guidelines</sub></a></li>
<li><a href="#sec-6-2">6.2. PKGBUILD Template</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Custom Repository</a></li>
<li><a href="#sec-8">8. compton-git</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> LXDE Package Tables</h2>
<div class="outline-text-2" id="text-1">
<table id="base-libraries" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">r</th>
<th scope="col" class="left">Name</th>
<th scope="col" class="right">Built</th>
<th scope="col" class="left">Web</th>
<th scope="col" class="left">GitHub</th>
<th scope="col" class="left">AUR</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">148</td>
<td class="left">libqtxdg</td>
<td class="right">14-02-24</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#libqtxdg">#libqtxdg</a></td>
<td class="left"><a href="https://github.com/lxde/libqtxdg">libqtxdg</a></td>
<td class="left"><a href="https://aur.archlinux.org/packages/libqtxdg-git/">libqtxdg-git</a></td>
</tr>

<tr>
<td class="right">253</td>
<td class="left">liblxqt</td>
<td class="right">14-02-24</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#liblxqt">#liblxqt</a></td>
<td class="left"><a href="https://github.com/lxde/liblxqt">liblxqt</a></td>
<td class="left"><a href="https://aur.archlinux.org/packages/liblxqt-git/">liblxqt-git</a></td>
</tr>

<tr>
<td class="right">37</td>
<td class="left">liblxqt-mount</td>
<td class="right">14-02-24</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#liblxqt-mount">#liblxqt-mount</a></td>
<td class="left"><a href="https://github.com/lxde/liblxqt-mount">liblxqt-mount</a></td>
<td class="left"><a href="https://aur.archlinux.org/packages/liblxqt-mount-git/">liblxqt-mount-git</a></td>
</tr>

<tr>
<td class="right">107</td>
<td class="left">lxqt-globalkeys</td>
<td class="right">14-02-24</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#lxqt-globalkeys">#lxqt-globalkeys</a></td>
<td class="left"><a href="https://github.com/lxde/lxqt-globalkeys">lxqt-globalkeys</a></td>
<td class="left"><a href="https://aur.archlinux.org/packages/lxqt-globalkeys-git/">lxqt-globalkeys-git</a></td>
</tr>

<tr>
<td class="right">68</td>
<td class="left">lxqt-notificationd</td>
<td class="right">14-02-24</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#lxqt-notificationd">#lxqt-notificationd</a></td>
<td class="left"><a href="https://github.com/lxde/lxqt-notificationd">lxqt-notificationd</a></td>
<td class="left"><a href="https://aur.archlinux.org/packages/lxqt-notificationd-git/">lxqt-notificationd-git</a></td>
</tr>

<tr>
<td class="right">20</td>
<td class="left">libsysstat</td>
<td class="right">14-02-26</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#libsysstat">#libsysstat</a></td>
<td class="left"><a href="https://github.com/lxde/libsysstat">lxde/libsysstat</a></td>
<td class="left"><a href="https://aur.archlinux.org/packages/libsysstat-git/">libsysstat-git</a></td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">menu-cache</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">libfm</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<table id="major-components" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">r</th>
<th scope="col" class="left">Name</th>
<th scope="col" class="right">Built</th>
<th scope="col" class="left">Web</th>
<th scope="col" class="left">GitHub</th>
<th scope="col" class="left">AUR</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">800</td>
<td class="left"><a href="lxqt-panel-git/PKGBUILD">lxqt-panel</a></td>
<td class="right">14-02-25</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#lxqt-panel">#lxqt-panel</a></td>
<td class="left"><a href="https://github.com/lxde/lxqt-panel">lxde/lxqt-panel</a></td>
<td class="left"><a href="https://aur.archlinux.org/packages/lxqt-panel-git">lxqt-panel-git</a></td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">pcmanfm-qt</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-session</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-runner</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-qtplugin</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-appswitcher</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-policykit</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-openssh-askpass</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-power</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-powermanagement</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lximage-qt</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-config</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxinput-qt</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-config-randr</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">obconf-qt</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">compton-conf</td>
<td class="right">&#xa0;</td>
<td class="left"><a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#compton-conf">#compton-conf</a></td>
<td class="left"><a href="https://github.com/lxde/compton-conf">compton-conf</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-about</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">lxqt-lightdm-greeter</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
