AUR/LXQT/lxde-qt.org
* Step by step package build
1. [-]  Build the base libraries
   1. [ ] build and install [[https://github.com/lxde/libqtxdg][libqtxdg]] 
      - Latest commit Feb 07, 2014 
      - Library providing freedesktop.org specs implementations for Qt.
      #+BEGIN_SRC sh
      wget https://aur.archlinux.org/packages/li/libqtxdg-git/libqtxdg-git.tar.gz
      #+END_SRC
      #+BEGIN_SRC sh :tangle libqtxdg-git/PKGBUILD
      # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
      # Maintainer: Troy Will <troydwill@gmail.com>
        
      _pkgname=libqtxdg
      pkgname=$_pkgname-git
      pkgver=0.0.0
      pkgrel=1
      pkgdesc="Library providing freedesktop.org specs implementations for Qt."
      arch=('i686' 'x86_64')
      url="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#libqtxdg"
      license=('GPL2')
      depends=('qt4')
      makedepends=('git' 'cmake')
      provides=("$_pkgname")
      conflicts=("$_pkgname")
      source=("git://github.com/lxde/$_pkgname.git")
      # Because the source is not static, skip Git checksum:        
      sha256sums=('SKIP')
      _gitname=$_pkgname
        
      pkgver() {
      cd "$srcdir/$_gitname"
      printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
      }
        
      build() {
      cd "$srcdir/$_gitname"
      mkdir -p build
      cd build
      cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
      make
      }
        
      package() {
      cd "$srcdir/$_gitname"
      cd build
      make DESTDIR="$pkgdir" install
      }
      #+END_SRC
   2. [ ] build and install [[https://github.com/lxde/liblxqt][liblxqt]] 
      - Core utility library for all LXDE-Qt components
      #+BEGIN_SRC sh
      wget https://aur.archlinux.org/packages/li/liblxqt-git/liblxqt-git.tar.gz      
      #+END_SRC
      #+BEGIN_SRC sh :tangle liblxqt-git/PKGBUILD :padline no
      # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
      # Maintainer: Troy Will <troydwill@gmail.com>
        
      _pkgname=liblxqt
      pkgname=$_pkgname-git
      pkgver=0.0.0
      pkgrel=1
      pkgdesc="Common base library for LXQt components."
      arch=('i686' 'x86_64')
      url="http://www.lxde.org"
      license=('GPL2')
      depends=('qt4' 'libqtxdg-git')
      makedepends=('git' 'cmake')
      provides=($_pkgname)
      conflicts=($_pkgname)
      source=("git://github.com/lxde/$_pkgname.git")
      sha256sums=('SKIP')
      _gitname=$_pkgname
        
      pkgver() {
      cd "$srcdir/$_gitname"
      printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
      }
        
      build() {
      cd "$srcdir/$_gitname"
      mkdir -p build
      cd build
      cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
      make
      }
        
      package() {
      cd "$srcdir/$_gitname"
      cd build
      make DESTDIR="$pkgdir" install
      }
        
      #+END_SRC
   3. [ ] build and install [[https://github.com/lxde/liblxqt-mount][liblxqt-mount]] 
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/li/liblxqt-mount-git/liblxqt-mount-git.tar.gz
      #+END_SRC
      #+BEGIN_SRC sh :tangle liblxqt-mount-git/PKGBUILD :padline no
        # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
        
        _pkgname=liblxqt-mount
        pkgname=$_pkgname-git
        pkgver=0.0.0
        pkgrel=1
        pkgdesc="LXQt library used to manage removable devices."
        arch=('i686' 'x86_64')
        url="http://www.lxde.org"
        license=('GPL2')
        depends=('qt4' 'liblxqt-git')
        makedepends=('git' 'cmake')
        provides=($_pkgname)
        conflicts=($_pkgname)
        source=("git://github.com/lxde/$_pkgname.git")
        sha256sums=('SKIP')
        _gitname=$_pkgname
        
        pkgver() {
                cd "$srcdir/$_gitname"
                echo "$(git rev-list --count HEAD).$(git describe --always)"
        }
        
        build() {
                cd "$srcdir/$_gitname"
                mkdir -p build
                cd build
                cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
                make
        }
        
        package() {
                cd "$srcdir/$_gitname"
                cd build
                make DESTDIR="$pkgdir" install
        }
        
      #+END_SRC
   4. [ ] build and install [[https://github.com/lxde/lxqt-globalkeys][lxqt-globalkeys]] 
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-globalkeys-git/lxqt-globalkeys-git.tar.gz      
      #+END_SRC
      #+BEGIN_SRC sh :tangle lxqt-globalkeys-git/PKGBUILD :padline no
        # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
        # Maintainer: Troy Will <troydwill@gmail.com>
        
        _pkgname=lxqt-globalkeys
        pkgname=$_pkgname-git
        pkgver=0.0.0
        pkgrel=1
        pkgdesc="Package description here."
        arch=('i686' 'x86_64')
        url="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"
        license=('GPL2')
        depends=('qt4')
        makedepends=('git' 'cmake')
        provides=("$_pkgname")
        conflicts=("$_pkgname")
        source=("git://github.com/lxde/$_pkgname.git")
        # Because the source is not static, skip Git checksum:        
        sha256sums=('SKIP')
        _gitname=$_pkgname
        
        pkgver() {
            cd "$srcdir/$_gitname"
            printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
        }
        
        build() {
            cd "$srcdir/$_gitname"
            mkdir -p build
            cd build
            cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
            make
        }
        
        package() {
            cd "$srcdir/$_gitname"
            cd build
            make DESTDIR="$pkgdir" install
        }
      #+END_SRC
   5. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-notificationd-git/][lxqt-notificationd-git]] (see [[http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#lxqt-notificationd][#lxqt-notificationd]])
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-notificationd-git/lxqt-notificationd-git.tar.gz
      #+END_SRC
      #+BEGIN_SRC sh :tangle lxqt-notificationd-git/PKGBUILD :padline no
        # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
        # Maintainer: Troy Will <troydwill@gmail.com>
        
        _pkgname=lxqt-notificationd
        pkgname=$_pkgname-git
        pkgver=0.0.0
        pkgrel=1
        pkgdesc="Package description here."
        arch=('i686' 'x86_64')
        url="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"
        license=('GPL2')
        depends=('qt4')
        makedepends=('git' 'cmake')
        provides=("$_pkgname")
        conflicts=("$_pkgname")
        source=("git://github.com/lxde/$_pkgname.git")
        # Because the source is not static, skip Git checksum:        
        sha256sums=('SKIP')
        _gitname=$_pkgname
        
        pkgver() {
            cd "$srcdir/$_gitname"
            printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
        }
        
        build() {
            cd "$srcdir/$_gitname"
            mkdir -p build
            cd build
            cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
            make
        }
        
        package() {
            cd "$srcdir/$_gitname"
            cd build
            make DESTDIR="$pkgdir" install
        }
      #+END_SRC
   6. [X] build and install [[https://aur.archlinux.org/packages/libsysstat-git/][libsysstat-git]] (see [[http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#libsysstat][#libsysstat]])
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/li/libsysstat-git/libsysstat-git.tar.gz
      #+END_SRC
      #+BEGIN_SRC sh :tangle libsysstat-git/PKGBUILD :padline no
        # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
        # Maintainer: Troy Will <troydwill@gmail.com>
        
        _pkgname=libsysstat
        pkgname=$_pkgname-git
        pkgver=0.0.0
        pkgrel=1
        pkgdesc="Package description here."
        arch=('i686' 'x86_64')
        url="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"
        license=('GPL2')
        depends=('qt4')
        makedepends=('git' 'cmake')
        provides=("$_pkgname")
        conflicts=("$_pkgname")
        source=("git://github.com/lxde/$_pkgname.git")
        # Because the source is not static, skip Git checksum:        
        sha256sums=('SKIP')
        _gitname=$_pkgname
        
        pkgver() {
            cd "$srcdir/$_gitname"
            printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
        }
        
        build() {
            cd "$srcdir/$_gitname"
            mkdir -p build
            cd build
            cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
            make
        }
        
        package() {
            cd "$srcdir/$_gitname"
            cd build
            make DESTDIR="$pkgdir" install
        }
      #+END_SRC
      
   7. [ ] install menu-cache
      #+BEGIN_SRC sh
        pacman --sync menu-cache
      #+END_SRC
   8. [ ] build and install [[https://aur.archlinux.org/packages/libfm-git/][libfm-git]]
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/li/libfm-git/libfm-git.tar.gz
      #+END_SRC
      - checking for XML::Parser... configure: error: XML::Parser perl module is required for intltool
      - cpanm --sudo XML::Parser
2. [ ] [[http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#Build_major_components][Build major components]]
   1. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-panel-git/][lxqt-panel-git]] (see [[http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#lxqt-panel][#lxqt-panel]])
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-panel-git/lxqt-panel-git.tar.gz
      #+END_SRC
      #+BEGIN_SRC sh :tangle lxqt-panel-git/PKGBUILD :padline no
        # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
        # Maintainer: Troy Will <troydwill@gmail.com>
             
        _pkgname=lxqt-panel
        pkgname=$_pkgname-git
        pkgver=0.0.0
        pkgrel=1
        pkgdesc="Package description here."
        arch=('i686' 'x86_64')
        url="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"
        license=('GPL2')
        depends=('qt4>=4.6' 'cmake>=2.6' 'libqtxdg' 'liblxqt' 'lxqt-globalkeys' 'liblxqt-mount' 'libx11' 'libsysstat-git')
        makedepends=('git' 'cmake')
        provides=("$_pkgname")
        conflicts=("$_pkgname")
        source=("git://github.com/lxde/$_pkgname.git")
        # Because the source is not static, skip Git checksum:        
        sha256sums=('SKIP')
        _gitname=$_pkgname
        
        pkgver() {
            cd "$srcdir/$_gitname"
            printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
        }
        
        build() {
            cd "$srcdir/$_gitname"
            mkdir -p build
            cd build
            cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
            make
        }
        
        package() {
            cd "$srcdir/$_gitname"
            cd build
            make DESTDIR="$pkgdir" install
        }
      #+END_SRC
   2. [ ] build and install [[https://aur.archlinux.org/packages/pcmanfm-qt-git/][pcmanfm-qt-git]] (See [[http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#pcmanfm-qt][#pcmanfm-qt]])
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/pc/pcmanfm-qt-git/pcmanfm-qt-git.tar.gz
       #+END_SRC
   3. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-session-git/][lxqt-session-git]]
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-session-git/lxqt-session-git.tar.gz
      #+END_SRC
   4. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-runner-git/][lxqt-runner-git]]
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-runner-git/lxqt-runner-git.tar.gz
      #+END_SRC
   5. [ ] TODO lxqt-qtplugin-git
   6. [ ] TODO lxqt-appswitcher   
   7. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-policykit-git/][lxqt-policykit-git]]
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-policykit-git/lxqt-policykit-git.tar.gz
      #+END_SRC
   8. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-openssh-askpass-git/][lxqt-openssh-askpass-git]]
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-openssh-askpass-git/lxqt-openssh-askpass-git.tar.gz
      #+END_SRC
   9. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-power-git/][lxqt-power-git]]
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-power-git/lxqt-power-git.tar.gz
      #+END_SRC
   10. [ ] TODO lxqt-powermanagement
   11. [ ] build and install [[https://aur.archlinux.org/packages/lximage-qt-git/][lximage-qt-git]]
       #+BEGIN_SRC sh
         wget https://aur.archlinux.org/packages/lx/lximage-qt-git/lximage-qt-git.tar.gz
       #+END_SRC
   12. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-config-git/][lxqt-config-git]]
       #+BEGIN_SRC sh
         wget https://aur.archlinux.org/packages/lx/lxqt-config-git/lxqt-config-git.tar.gz
       #+END_SRC
   13. [ ] build and install [[https://aur.archlinux.org/packages/lxinput-qt-git/][lxinput-qt-git]]
       #+BEGIN_SRC sh
         wget https://aur.archlinux.org/packages/lx/lxinput-qt-git/lxinput-qt-git.tar.gz
       #+END_SRC
   14. [ ] compton-conf
       #+BEGIN_SRC sh :tangle compton-conf-git/PKGBUILD
         # Maintainer: Troy Will <troydwill@gmail.com>
         
         _pkgname=compton-conf
         pkgname=$_pkgname-git
         pkgver=0.0.0
         pkgrel=1
         pkgdesc="Package description here."
         arch=('i686' 'x86_64')
         url="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"
         license=('GPL2')
         depends=('qt4' 'libconfig')
         makedepends=('git' 'cmake')
         provides=("$_pkgname")
         conflicts=("$_pkgname")
         source=("git://github.com/lxde/$_pkgname.git")
         # Because the source is not static, skip Git checksum:        
         sha256sums=('SKIP')
         _gitname=$_pkgname
         
         pkgver() {
             cd "$srcdir/$_gitname"
             printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
         }
         
         build() {
             cd "$srcdir/$_gitname"
             mkdir -p build
             cd build
             cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
             make
         }
         
         package() {
             cd "$srcdir/$_gitname"
             cd build
             make DESTDIR="$pkgdir" install
         }
       #+END_SRC
   15. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-about-git/][lxqt-about-git]]
       #+BEGIN_SRC sh
         wget https://aur.archlinux.org/packages/lx/lxqt-about-git/lxqt-about-git.tar.gz
       #+END_SRC
3. [ ] [[http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#Install_data_files][Install data files]]
   1. [ ] build and install [[https://aur.archlinux.org/packages/lxqt-common-git/][lxqt-common-git]]
      #+BEGIN_SRC sh
        wget https://aur.archlinux.org/packages/lx/lxqt-common-git/lxqt-common-git.tar.gz
      #+END_SRC
   2. [ ] build and install 
      #+BEGIN_SRC sh
        pacman --sync lxmenu-data
      #+END_SRC
