AUR/LXQT/lxde-qt.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Step by step package build</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><code>[-]</code> Build the base libraries
<ol class="org-ol">
<li><code>[&#xa0;]</code> build and install <a href="https://github.com/lxde/libqtxdg">libqtxdg</a> 
<ul class="org-ul">
<li>Latest commit Feb 07, 2014 
</li>
<li>Library providing freedesktop.org specs implementations for Qt.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/li/libqtxdg-git/libqtxdg-git.tar.gz
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=libqtxdg
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Library providing freedesktop.org specs implementations for Qt."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#libqtxdg"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the source is not static, skip Git checksum:        </span>
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
<span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
<span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
<span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
mkdir -p build
<span style="color: #483d8b;">cd</span> build
cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
make
}

<span style="color: #0000ff;">package</span>() {
<span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
<span style="color: #483d8b;">cd</span> build
make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://github.com/lxde/liblxqt">liblxqt</a> 
<ul class="org-ul">
<li>Core utility library for all LXDE-Qt components
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/li/liblxqt-git/liblxqt-git.tar.gz
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=liblxqt
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Common base library for LXQt components."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://www.lxde.org"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span> <span style="color: #8b2252;">'libqtxdg-git'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=($<span style="color: #a0522d;">_pkgname</span>)
<span style="color: #a0522d;">conflicts</span>=($<span style="color: #a0522d;">_pkgname</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
<span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
<span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
<span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
mkdir -p build
<span style="color: #483d8b;">cd</span> build
cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
make
}

<span style="color: #0000ff;">package</span>() {
<span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
<span style="color: #483d8b;">cd</span> build
make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://github.com/lxde/liblxqt-mount">liblxqt-mount</a> 
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/li/liblxqt-mount-git/liblxqt-mount-git.tar.gz
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=liblxqt-mount
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"LXQt library used to manage removable devices."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://www.lxde.org"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span> <span style="color: #8b2252;">'liblxqt-git'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=($<span style="color: #a0522d;">_pkgname</span>)
<span style="color: #a0522d;">conflicts</span>=($<span style="color: #a0522d;">_pkgname</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
        <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD).$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> describe --always)"</span>
}

<span style="color: #0000ff;">build</span>() {
        <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
        mkdir -p build
        <span style="color: #483d8b;">cd</span> build
        cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
        make
}

<span style="color: #0000ff;">package</span>() {
        <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
        <span style="color: #483d8b;">cd</span> build
        make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://github.com/lxde/lxqt-globalkeys">lxqt-globalkeys</a> 
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-globalkeys-git/lxqt-globalkeys-git.tar.gz
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=lxqt-globalkeys
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Package description here."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the source is not static, skip Git checksum:        </span>
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    mkdir -p build
    <span style="color: #483d8b;">cd</span> build
    cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
    make
}

<span style="color: #0000ff;">package</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">cd</span> build
    make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-notificationd-git/">lxqt-notificationd-git</a> (see <a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#lxqt-notificationd">#lxqt-notificationd</a>)
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-notificationd-git/lxqt-notificationd-git.tar.gz
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=lxqt-notificationd
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Package description here."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the source is not static, skip Git checksum:        </span>
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    mkdir -p build
    <span style="color: #483d8b;">cd</span> build
    cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
    make
}

<span style="color: #0000ff;">package</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">cd</span> build
    make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>
<li><code>[X]</code> build and install <a href="https://aur.archlinux.org/packages/libsysstat-git/">libsysstat-git</a> (see <a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#libsysstat">#libsysstat</a>)
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/li/libsysstat-git/libsysstat-git.tar.gz
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=libsysstat
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Package description here."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the source is not static, skip Git checksum:        </span>
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    mkdir -p build
    <span style="color: #483d8b;">cd</span> build
    cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
    make
}

<span style="color: #0000ff;">package</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">cd</span> build
    make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>

<li><code>[&#xa0;]</code> install menu-cache
<div class="org-src-container">

<pre class="src src-sh">pacman --sync menu-cache
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/libfm-git/">libfm-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/li/libfm-git/libfm-git.tar.gz
</pre>
</div>
<ul class="org-ul">
<li>checking for XML::Parser&#x2026; configure: error: XML::Parser perl module is required for intltool
</li>
<li>cpanm &#x2013;sudo XML::Parser
</li>
</ul>
</li>
</ol>
</li>
<li><code>[&#xa0;]</code> <a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#Build_major_components">Build major components</a>
<ol class="org-ol">
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-panel-git/">lxqt-panel-git</a> (see <a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#lxqt-panel">#lxqt-panel</a>)
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-panel-git/lxqt-panel-git.tar.gz
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=lxqt-panel
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Package description here."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4&gt;=4.6'</span> <span style="color: #8b2252;">'cmake&gt;=2.6'</span> <span style="color: #8b2252;">'libqtxdg'</span> <span style="color: #8b2252;">'liblxqt'</span> <span style="color: #8b2252;">'lxqt-globalkeys'</span> <span style="color: #8b2252;">'liblxqt-mount'</span> <span style="color: #8b2252;">'libx11'</span> <span style="color: #8b2252;">'libsysstat-git'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the source is not static, skip Git checksum:        </span>
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    mkdir -p build
    <span style="color: #483d8b;">cd</span> build
    cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
    make
}

<span style="color: #0000ff;">package</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">cd</span> build
    make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/pcmanfm-qt-git/">pcmanfm-qt-git</a> (See <a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#pcmanfm-qt">#pcmanfm-qt</a>)
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/pc/pcmanfm-qt-git/pcmanfm-qt-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-session-git/">lxqt-session-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-session-git/lxqt-session-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-runner-git/">lxqt-runner-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-runner-git/lxqt-runner-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> TODO lxqt-qtplugin-git
</li>
<li><code>[&#xa0;]</code> TODO lxqt-appswitcher   
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-policykit-git/">lxqt-policykit-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-policykit-git/lxqt-policykit-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-openssh-askpass-git/">lxqt-openssh-askpass-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-openssh-askpass-git/lxqt-openssh-askpass-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-power-git/">lxqt-power-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-power-git/lxqt-power-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> TODO lxqt-powermanagement
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lximage-qt-git/">lximage-qt-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lximage-qt-git/lximage-qt-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-config-git/">lxqt-config-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-config-git/lxqt-config-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxinput-qt-git/">lxinput-qt-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxinput-qt-git/lxinput-qt-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> compton-conf
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=compton-conf
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Package description here."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span> <span style="color: #8b2252;">'libconfig'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the source is not static, skip Git checksum:        </span>
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    mkdir -p build
    <span style="color: #483d8b;">cd</span> build
    cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
    make
}

<span style="color: #0000ff;">package</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">cd</span> build
    make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-about-git/">lxqt-about-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-about-git/lxqt-about-git.tar.gz
</pre>
</div>
</li>
</ol>
</li>
<li><code>[&#xa0;]</code> <a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source#Install_data_files">Install data files</a>
<ol class="org-ol">
<li><code>[&#xa0;]</code> build and install <a href="https://aur.archlinux.org/packages/lxqt-common-git/">lxqt-common-git</a>
<div class="org-src-container">

<pre class="src src-sh">wget https://aur.archlinux.org/packages/lx/lxqt-common-git/lxqt-common-git.tar.gz
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> build and install 
<div class="org-src-container">

<pre class="src src-sh">pacman --sync lxmenu-data
</pre>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
