AUR/LXQT/lxde-qt.org
* https://wiki.archlinux.org/index.php/Lxqt
* https://aur.archlinux.org/packages/?O=0&K=lxqt
* [[http://wiki.lxde.org/en/LXDE-Qt][LXDE-Qt]]
  http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source
* Package Building Documentation
** [[https://wiki.archlinux.org/index.php/VCS_PKGBUILD_Guidelines][VCS_PKGBUILD_Guidelines]]
   #+BEGIN_SRC sh
     # Maintainer: Dave Reisner <d@falconindy.com> 
     # Contributor: William Giokas (KaiSforza) <1007380@gmail.com>
     
     pkgname=expac-git
     pkgver=0.0.0
     pkgrel=1
     pkgdesc="Pacman database extraction utility"
     arch=('i686' 'x86_64')
     url="https://github.com/falconindy/expac"
     license=('MIT')
     depends=('pacman')
     makedepends=('git')
     conflicts=('expac')
     provides=('expac')
     # The git repo is detected by the 'git:' or 'git+' beginning. The branch
     # '$pkgname' is then checked out upon cloning, expediating versioning:
     #source=('git+https://github.com/falconindy/expac.git'
     source=("$pkgname"::'git://github.com/falconindy/expac.git'
             'expac_icon.png')
     # Because the sources are not static, skip Git checksum:
     md5sums=('SKIP'
              '020c36e38466b68cbc7b3f93e2044b49')
     
     pkgver() {
       cd "$srcdir/$pkgname"
       # Use the tag of the last commit
       git describe --long | sed -E 's/([^-]*-g)/r\1/;s/-/./g'
     }
     
     build() {
       cd "$srcdir/$pkgname"
       make
     }
     
     package() {
       cd "$srcdir/$pkgname"
       make PREFIX=/usr DESTDIR="$pkgdir" install
       install -Dm644 "$srcdir/expac_icon.png" "$pkgdir/usr/share/pixmaps/expac.png"
     }   
   #+END_SRC
** PKGBUILD Template
   # :tangle XXXX/PKGBUILD :padline no
   #+BEGIN_SRC sh
     # Maintainer: Jerome Leclanche <jerome.leclanche+arch@gmail.com>
     # Maintainer: Troy Will <troydwill@gmail.com>
     
     _pkgname=PACKAGE_NAME
     pkgname=$_pkgname-git
     pkgver=0.0.0
     pkgrel=1
     pkgdesc="Package description here."
     arch=('i686' 'x86_64')
     url="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"
     license=('GPL2')
     depends=('qt4')
     makedepends=('git' 'cmake')
     provides=("$_pkgname")
     conflicts=("$_pkgname")
     source=("git://github.com/lxde/$_pkgname.git")
     # Because the source is not static, skip Git checksum:        
     sha256sums=('SKIP')
     _gitname=$_pkgname
     
     pkgver() {
         cd "$srcdir/$_gitname"
         printf "r%s.%s" "$(git rev-list --count HEAD)" "$(git rev-parse --short HEAD)"
     }
     
     build() {
         cd "$srcdir/$_gitname"
         mkdir -p build
         cd build
         cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
         make
     }
     
     package() {
         cd "$srcdir/$_gitname"
         cd build
         make DESTDIR="$pkgdir" install
     }
   #+END_SRC
* Custom Repository
  #+BEGIN_SRC conf
    #
    # /etc/pacman.conf
    #
    # See the pacman.conf(5) manpage for option and repository directives
    
    [shiloh-lxqt]
    SigLevel = Optional TrustAll
    Server = http://192.168.1.3/shiloh-lxqt
    
  #+END_SRC
