AUR/LXQT/lxde-qt.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wiki.archlinux.org/index.php/Lxqt">https://wiki.archlinux.org/index.php/Lxqt</a></h2>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://aur.archlinux.org/packages/?O=0&K=lxqt">https://aur.archlinux.org/packages/?O=0&K=lxqt</a></h2>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="http://wiki.lxde.org/en/LXDE-Qt">LXDE-Qt</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source">http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source</a>
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Package Building Documentation</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <a href="https://wiki.archlinux.org/index.php/VCS_PKGBUILD_Guidelines">VCS<sub>PKGBUILD</sub><sub>Guidelines</sub></a></h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Dave Reisner <a href="mailto:d%40falconindy.com">&lt;d@falconindy.com&gt;</a> </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Contributor: William Giokas (KaiSforza) <a href="mailto:1007380%40gmail.com">&lt;1007380@gmail.com&gt;</a></span>

<span style="color: #a0522d;">pkgname</span>=expac-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Pacman database extraction utility"</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"https://github.com/falconindy/expac"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'MIT'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'pacman'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">'expac'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">'expac'</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">The git repo is detected by the 'git:' or 'git+' beginning. The branch</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">'$pkgname' is then checked out upon cloning, expediating versioning:</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">source=('git+https://github.com/falconindy/expac.git'</span>
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"$pkgname"</span>::<span style="color: #8b2252;">'git://github.com/falconindy/expac.git'</span>
        <span style="color: #8b2252;">'expac_icon.png'</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the sources are not static, skip Git checksum:</span>
<span style="color: #a0522d;">md5sums</span>=(<span style="color: #8b2252;">'SKIP'</span>
         <span style="color: #8b2252;">'020c36e38466b68cbc7b3f93e2044b49'</span>)

<span style="color: #0000ff;">pkgver</span>() {
  <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$pkgname"</span>
  <span style="color: #b22222;"># </span><span style="color: #b22222;">Use the tag of the last commit</span>
  git describe --long | sed -E <span style="color: #8b2252;">'s/([^-]*-g)/r\1/;s/-/./g'</span>
}

<span style="color: #0000ff;">build</span>() {
  <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$pkgname"</span>
  make
}

<span style="color: #0000ff;">package</span>() {
  <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$pkgname"</span>
  make <span style="color: #a0522d;">PREFIX</span>=/usr <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
  install -Dm644 <span style="color: #8b2252;">"$srcdir/expac_icon.png"</span> <span style="color: #8b2252;">"$pkgdir/usr/share/pixmaps/expac.png"</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> PKGBUILD Template</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Jerome Leclanche <a href="mailto:jerome.leclanche+arch%40gmail.com">&lt;jerome.leclanche+arch@gmail.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: Troy Will <a href="mailto:troydwill%40gmail.com">&lt;troydwill@gmail.com&gt;</a></span>

<span style="color: #a0522d;">_pkgname</span>=PACKAGE_NAME
<span style="color: #a0522d;">pkgname</span>=$<span style="color: #a0522d;">_pkgname</span>-git
<span style="color: #a0522d;">pkgver</span>=0.0.0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"Package description here."</span>
<span style="color: #a0522d;">arch</span>=(<span style="color: #8b2252;">'i686'</span> <span style="color: #8b2252;">'x86_64'</span>)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"http://wiki.lxde.org/en/Build_LXDE-Qt_From_Source"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'GPL2'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'qt4'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'cmake'</span>)
<span style="color: #a0522d;">provides</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">conflicts</span>=(<span style="color: #8b2252;">"$_pkgname"</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/lxde/$_pkgname.git"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Because the source is not static, skip Git checksum:        </span>
<span style="color: #a0522d;">sha256sums</span>=(<span style="color: #8b2252;">'SKIP'</span>)
<span style="color: #a0522d;">_gitname</span>=$<span style="color: #a0522d;">_pkgname</span>

<span style="color: #0000ff;">pkgver</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">printf</span> <span style="color: #8b2252;">"r%s.%s"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-list --count HEAD)"</span> <span style="color: #8b2252;">"$(</span><span style="color: #ff00ff;">git</span><span style="color: #8b2252;"> rev-parse --short HEAD)"</span>
}

<span style="color: #0000ff;">build</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    mkdir -p build
    <span style="color: #483d8b;">cd</span> build
    cmake -DCMAKE_INSTALL_PREFIX=/usr  ..
    make
}

<span style="color: #0000ff;">package</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
    <span style="color: #483d8b;">cd</span> build
    make <span style="color: #a0522d;">DESTDIR</span>=<span style="color: #8b2252;">"$pkgdir"</span> install
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Custom Repository</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-conf"><span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">/etc/pacman.conf</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">See the pacman.conf(5) manpage for option and repository directives</span>

[<span style="color: #228b22;">shiloh-lxqt</span>]
<span style="color: #a0522d;">SigLevel</span> = Optional TrustAll
<span style="color: #a0522d;">Server</span> = http://192.168.1.3/shiloh-lxqt
</pre>
</div>
</div>
</div>
