AUR/LXQT/lxde-qt.org
* compton-git
  #+BEGIN_SRC sh
    
  #+END_SRC
  #+BEGIN_SRC sh :tangle compton-git/PKGBUILD :padline no
    # Maintainer: OK100 <ok100 at lavabit dot com>
    # Previous Maintainer: Valère Monseur <valere dot monseur at ymail dot com>
    
    pkgname=compton-git
    _gitname=compton
    pkgver=0
    pkgrel=1
    pkgdesc="X Compositor (a fork of xcompmgr-dana)"
    arch=(i686 x86_64)
    url="https://github.com/chjj/compton"
    license=('MIT')
    depends=('libgl' 'libdbus' 'libxcomposite' 'libxdamage' 'libxrandr' 'pcre' 'libconfig' 'libxinerama')
    optdepends=('xorg-xprop: for compton-trans'
                'xorg-xwininfo: for compton-trans')
    makedepends=('git' 'asciidoc')
    source=("git://github.com/chjj/compton.git")
    md5sums=("SKIP")
    
    pkgver() {
        cd "${srcdir}/${_gitname}"
        # Use the tag of the last commit
        git describe --long | sed -E 's/([^-]*-g)/r\1/;s/-/./g'
    }
    
    build() {
      cd "$srcdir/$_gitname"
      make PREFIX=/usr
      make docs
    }
    
    package() {
      cd "$srcdir/$_gitname"
    
      make PREFIX="$pkgdir/usr" install
    
      # install license
      install -D -m644 "LICENSE" "$pkgdir/usr/share/licenses/$_gitname/LICENSE"
    
      # example conf
      install -D -m644 "compton.sample.conf" "$pkgdir/etc/xdg/compton.conf.example"
    }
    
  #+END_SRC
  
  
