AUR/LXQT/lxde-qt.html

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> compton-git</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Maintainer: OK100 &lt;ok100 at lavabit dot com&gt;</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Previous Maintainer: Val&#232;re Monseur &lt;valere dot monseur at ymail dot com&gt;</span>

<span style="color: #a0522d;">pkgname</span>=compton-git
<span style="color: #a0522d;">_gitname</span>=compton
<span style="color: #a0522d;">pkgver</span>=0
<span style="color: #a0522d;">pkgrel</span>=1
<span style="color: #a0522d;">pkgdesc</span>=<span style="color: #8b2252;">"X Compositor (a fork of xcompmgr-dana)"</span>
<span style="color: #a0522d;">arch</span>=(i686 x86_64)
<span style="color: #a0522d;">url</span>=<span style="color: #8b2252;">"https://github.com/chjj/compton"</span>
<span style="color: #a0522d;">license</span>=(<span style="color: #8b2252;">'MIT'</span>)
<span style="color: #a0522d;">depends</span>=(<span style="color: #8b2252;">'libgl'</span> <span style="color: #8b2252;">'libdbus'</span> <span style="color: #8b2252;">'libxcomposite'</span> <span style="color: #8b2252;">'libxdamage'</span> <span style="color: #8b2252;">'libxrandr'</span> <span style="color: #8b2252;">'pcre'</span> <span style="color: #8b2252;">'libconfig'</span> <span style="color: #8b2252;">'libxinerama'</span>)
<span style="color: #a0522d;">optdepends</span>=(<span style="color: #8b2252;">'xorg-xprop: for compton-trans'</span>
            <span style="color: #8b2252;">'xorg-xwininfo: for compton-trans'</span>)
<span style="color: #a0522d;">makedepends</span>=(<span style="color: #8b2252;">'git'</span> <span style="color: #8b2252;">'asciidoc'</span>)
<span style="color: #a0522d;">source</span>=(<span style="color: #8b2252;">"git://github.com/chjj/compton.git"</span>)
<span style="color: #a0522d;">md5sums</span>=(<span style="color: #8b2252;">"SKIP"</span>)

<span style="color: #0000ff;">pkgver</span>() {
    <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"${srcdir}/${_gitname}"</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Use the tag of the last commit</span>
    git describe --long | sed -E <span style="color: #8b2252;">'s/([^-]*-g)/r\1/;s/-/./g'</span>
}

<span style="color: #0000ff;">build</span>() {
  <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>
  make <span style="color: #a0522d;">PREFIX</span>=/usr
  make docs
}

<span style="color: #0000ff;">package</span>() {
  <span style="color: #483d8b;">cd</span> <span style="color: #8b2252;">"$srcdir/$_gitname"</span>

  make <span style="color: #a0522d;">PREFIX</span>=<span style="color: #8b2252;">"$pkgdir/usr"</span> install

  <span style="color: #b22222;"># </span><span style="color: #b22222;">install license</span>
  install -D -m644 <span style="color: #8b2252;">"LICENSE"</span> <span style="color: #8b2252;">"$pkgdir/usr/share/licenses/$_gitname/LICENSE"</span>

  <span style="color: #b22222;"># </span><span style="color: #b22222;">example conf</span>
  install -D -m644 <span style="color: #8b2252;">"compton.sample.conf"</span> <span style="color: #8b2252;">"$pkgdir/etc/xdg/compton.conf.example"</span>
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2014-02-26 Wed 09:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5f)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
